andrecurvello/RX63N-Collection/Micrium_RTOS_Template_Project/RTOS1/trash/fit_2017-01-27 18_59_51/r_irq_rx/src/r_irq_rx.c
#if IRQ_CFG_USE_IRQ15 == 1
irq_callback p_callback_irq15;
const irq_init_block_t g_irq15_handle =
{
    IRQ_NUM_15,                            /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ15,          /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ15,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ15,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ15,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq15,                    /* pointer to callback function pointer. */
    &(uint8_t)IRQ_PORT_IRQ15.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ15,                   /* I/O port input data bit mask for this IRQ. */
};
#endif
#endif

static const irq_handle_t g_irq_handles[] =
{
    #if IRQ_CFG_USE_IRQ0 == 1
    (irq_handle_t)&g_irq0_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ1 == 1
    (irq_handle_t)&g_irq1_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ2 == 1
    (irq_handle_t)&g_irq2_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ3 == 1
    (irq_handle_t)&g_irq3_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ4 == 1
    (irq_handle_t)&g_irq4_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ5 == 1
    (irq_handle_t)&g_irq5_handle,
    #else
    NULL,
    #endif
#if defined(VECT_ICU_IRQ7)
    #if IRQ_CFG_USE_IRQ6 == 1
    (irq_handle_t)&g_irq6_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ7 == 1
    (irq_handle_t)&g_irq7_handle,
    #else
    NULL,
    #endif
#endif
#if defined(VECT_ICU_IRQ15)
    #if IRQ_CFG_USE_IRQ8 == 1
    (irq_handle_t)&g_irq8_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ9 == 1
    (irq_handle_t)&g_irq9_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ10 == 1
    (irq_handle_t)&g_irq10_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ11 == 1
    (irq_handle_t)&g_irq11_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ12 == 1
    (irq_handle_t)&g_irq12_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ13 == 1
    (irq_handle_t)&g_irq13_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ14 == 1
    (irq_handle_t)&g_irq14_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ15 == 1
    (irq_handle_t)&g_irq15_handle,
    #else
    NULL,
    #endif
#endif
};

#if IRQ_CFG_PARAM_CHECKING == 1
static uint8_t g_irq_opened[IRQ_NUM_MAX] = {0};
#endif

/***********************************************************************************************************************
Function definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
* Function Name: R_IRQ_Open
* Description  : Initializes the IRQ registers, enables interrupts, provides handle for other API functions.
* Arguments    : irq_number -
*                    Number of the IRQ to be initialized
*                trigger -
*                    Enumerated type for trigger type: low level, rising edge, falling edge, both edges.
*                priority -
*                    Enumerated priority level setting for the IRQ.
*                phandle -
*                    Pointer to a handle for IRQ. Handle value will be set by this function.
*                pcallback -
*                    Pointer to function called from interrupt
* Return Value : IRQ_SUCCESS -
*                    Successful; IRQ initialized.
*                IRQ_ERR_BAD_NUM -
*                    IRQ number is invalid or unavailable.
*                IRQ_ERR_NOT_CLOSED -
*                    IRQ currently in operation; Perform R_IRQ_Close() first.
*                IRQ_ERR_INVALID_PTR -
*                    phandle pointer is NULL.
*                IRQ_ERR_INVALID_ARG -
*                    An invalid argument value was passed.
*                IRQ_ERR_LOCK -
*                    The lock could not be acquired.
***********************************************************************************************************************/
irq_err_t   R_IRQ_Open (irq_number_t     irq_number,
                        irq_trigger_t    trigger,
                        irq_prio_t       priority,
                        irq_handle_t    *phandle,
                        void        (*const pcallback)(void *pargs))
{
    irq_err_t ret = IRQ_SUCCESS;
    irq_handle_t  my_handle;
    uint8_t ier_index;
    uint8_t ien_mask;

#if IRQ_CFG_REQUIRE_LOCK == 1
    bool        lock_result = false;
#endif

#if IRQ_CFG_PARAM_CHECKING == 1
    if ((IRQ_NUM_MAX <= irq_number) || (NULL == g_irq_handles[irq_number]))
    {
        return IRQ_ERR_BAD_NUM;
    }
    if (g_irq_opened[irq_number]) /* Check for IRQ already opened. */
    {
        return  IRQ_ERR_NOT_CLOSED;
    }
    if ((trigger & IRQ_TRIGGER_MASK) || (priority > BSP_MCU_IPL_MAX))
    {
        return IRQ_ERR_INVALID_ARG;
    }
    if ((NULL == phandle) || (NULL == pcallback) || (FIT_NO_FUNC == pcallback))
    {
        return IRQ_ERR_INVALID_PTR;
    }
#endif

#if IRQ_CFG_REQUIRE_LOCK == 1
    /* Attempt to acquire lock for this IRQ. Prevents reentrancy conflict. */
    lock_result = R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_IRQ0 + irq_number));

    if(false == lock_result)
    {
        return IRQ_ERR_LOCK; /* The open function is currently locked. */
    }
#endif

    my_handle = g_irq_handles[irq_number];
    ier_index = my_handle->ier_reg_index;
    ien_mask = my_handle->ien_bit_mask;

    ICU.IER[ier_index].BYTE &= (~ien_mask);   /* Disable interrupt request. */

#if defined(VECT_ICU_IRQ15)
    if (7 >= irq_number) /* IRQs 0-7 share these registers. */
    {
#endif
        ICU.IRQFLTE0.BYTE &= (~ien_mask);   /* Disable digital filter.  */

        /* Set up the digital filter sampling clock divisor IRQFLTC0.FCLKSELi[1:0] bits for the IRQ. */
        ICU.IRQFLTC0.WORD &= (uint16_t)~(0x0003 << (irq_number * 2));                   /* First clear them. */
        ICU.IRQFLTC0.WORD |= ((uint16_t)(my_handle->filt_clk_div) << (irq_number * 2)); /* Now set them. */
#if defined(VECT_ICU_IRQ15)
    }

    else  /* IRQs 8-15 share these registers. */
    {
        ICU.IRQFLTE1.BYTE &= (~ien_mask);   /* Disable digital filter.  */

        /* Set up the digital filter sampling clock divisor IRQFLTC0.FCLKSELi[1:0] bits for the IRQ. */
        ICU.IRQFLTC1.WORD &= (uint16_t)~(0x0003 << ((irq_number - 8) * 2));             /* First clear them. */
        ICU.IRQFLTC1.WORD |= ((uint16_t)(my_handle->filt_clk_div) << ((irq_number - 8) * 2)); /* Now set them. */
    }
#endif

