andrecurvello/RX63N-Collection/Micrium_RTOS_Template_Project/RTOS1/trash/fit_2017-01-27 18_59_51/r_irq_rx/src/r_irq_rx.c
#if IRQ_CFG_REQUIRE_LOCK == 1
    /* Release lock for this IRQ. */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_IRQ0 + irq_number));
#endif
    return ret;
} /* End function R_IRQ_Control() */


/***********************************************************************************************************************
* Function Name: R_IRQ_Close
* Description  : Fully disables the IRQ designated by the handle.
* Arguments    : handle -
*                    Pointer to the handle for the IRQ.
* Return Value : IRQ_SUCCESS -
*                    Successful; IRQ closed.
*                IRQ_ERR_BAD_NUM -
*                    IRQ number is invalid or unavailable.
*                IRQ_ERR_NOT_OPENED -
*                    The IRQ has not been opened so closing has no effect.
*                IRQ_ERR_INVALID_PTR -
*                    A required pointer argument is NULL
***********************************************************************************************************************/
irq_err_t   R_IRQ_Close(irq_handle_t handle)
{
    irq_err_t ret = IRQ_SUCCESS;

    /* Validate input arguments. */
#if IRQ_CFG_PARAM_CHECKING == 1
    if (NULL == handle)
    {
        return IRQ_ERR_INVALID_PTR;
    }
    if (IRQ_NUM_MAX <= handle->irq_num)
    {
        return IRQ_ERR_BAD_NUM;
    }
    if (!(g_irq_opened[handle->irq_num])) /* Check for IRQ not opened. */
    {
        return  IRQ_ERR_NOT_OPENED;
    }
#endif

    ICU.IER[handle->ier_reg_index].BYTE &= (~(handle->ien_bit_mask));   /* Disable interrupt request. */

#if defined(VECT_ICU_IRQ15)
    if (7 >= handle->irq_num) /* IRQs 0-7 share these registers. */
    {
#endif
        ICU.IRQFLTE0.BYTE &= (~(handle->ien_bit_mask));   /* Disable digital filter.  */
#if defined(VECT_ICU_IRQ15)
    }

    else  /* IRQs 8-15 share these registers. */
    {
        ICU.IRQFLTE1.BYTE &= (~(handle->ien_bit_mask));   /* Disable digital filter.  */
    }
#endif

#if IRQ_CFG_PARAM_CHECKING == 1
    g_irq_opened[handle->irq_num] = 0;      /* Flag that IRQ has now been closed. */
#endif

    return ret;
} /* End function R_IRQ_Close() */


/***********************************************************************************************************************
* Function Name: R_IRQ_ReadInput
* Description  : Reads the current level of the pin assigned to the specified IRQ.
* Arguments    : handle -
*                    Handle pointer for the IRQ.
*                plevel -
*                    Pointer to storage for the returned value of the input level.
* Return Value : IRQ_SUCCESS -
*                    Operation successfully completed.
*                IRQ_ERR_BAD_NUM -
*                    IRQ number is invalid or unavailable.
*                IRQ_ERR_NOT_OPENED -
*                    The IRQ has not been opened.  Perform R_IRQ_Open() first
*                IRQ_ERR_INVALID_PTR -
*                    handle pointer is NULL
***********************************************************************************************************************/
irq_err_t   R_IRQ_ReadInput(irq_handle_t const handle, uint8_t *plevel)
{
    irq_err_t ret = IRQ_SUCCESS;

    /* Validate input arguments. */
#if IRQ_CFG_PARAM_CHECKING == 1
    if ((NULL == handle) || (NULL == plevel))
    {
        return IRQ_ERR_INVALID_PTR;
    }
    if (IRQ_NUM_MAX <= handle->irq_num)
    {
        return IRQ_ERR_BAD_NUM;
    }
    if (!(g_irq_opened[handle->irq_num])) /* Check for IRQ not opened. */
    {
        return  IRQ_ERR_NOT_OPENED;
    }
#endif

    *plevel = (uint8_t)((*handle->irq_in_port) & handle->irq_port_bit);

    return ret;
} /* End function R_IRQ_ReadInput() */


/***********************************************************************************************************************
* Function Name: R_IRQ_InterruptEnable
* Description  : Enables or disables the ICU interrupt for the specified IRQ.
* Arguments    : handle -
*                    Handle pointer for the IRQ.
*                enable -
*                    true  = enable the interrupt. false = disable interrupt.
* Return Value : IRQ_SUCCESS -
*                    Operation successfully completed.
*                IRQ_ERR_BAD_NUM -
*                    IRQ number is invalid or unavailable.
*                IRQ_ERR_NOT_OPENED -
*                    The IRQ has not been opened.  Perform R_IRQ_Open() first
*                IRQ_ERR_INVALID_PTR -
*                    handle pointer is NULL
***********************************************************************************************************************/
irq_err_t   R_IRQ_InterruptEnable (irq_handle_t const handle, bool enable)
{
    irq_err_t ret = IRQ_SUCCESS;

    /* Validate input arguments. */
#if IRQ_CFG_PARAM_CHECKING == 1
    if (NULL == handle)
    {
        return IRQ_ERR_INVALID_PTR;
    }
    if (IRQ_NUM_MAX <= handle->irq_num)
    {
        return IRQ_ERR_BAD_NUM;
    }
    if (!(g_irq_opened[handle->irq_num])) /* Check for IRQ not opened. */
    {
        return  IRQ_ERR_NOT_OPENED;
    }
#endif

    if(enable)
    {
        ICU.IER[handle->ier_reg_index].BYTE |= handle->ien_bit_mask;   /* Enable interrupt request. */
    }
    else
    {
        ICU.IER[handle->ier_reg_index].BYTE &= (~(handle->ien_bit_mask));   /* Disable interrupt request. */
    }

    if(ICU.IER[handle->ier_reg_index].BYTE) /* dummy read to complete pipelining. */
    {
        nop();
    }

    return ret;
} /* End function R_IRQ_InterruptEnable() */

/***********************************************************************************************************************
* Function Name: R_IRQ_GetVersion
* Description : Returns the version of this module. The version number is
* encoded where the top 2 bytes are the major version number and
* the bottom 2 bytes are the minor version number.
* For example, Rev 4.25 would be 0x00040019.
* NOTE: This function is inlined using #pragma inline directive.
* Arguments : none
* Return Value : Version Number
***********************************************************************************************************************/
#pragma inline(R_IRQ_GetVersion)
uint32_t R_IRQ_GetVersion(void)
{
    uint32_t version_number = 0;

    /* Bring in major version number. */
    version_number = ((uint16_t)IRQ_RX_VERSION_MAJOR) << 16;

    /* Bring in minor version number. */
    version_number |= (uint16_t)IRQ_RX_VERSION_MINOR;
    return version_number;
}

