andrecurvello/RX63N-Collection/Micrium_RTOS_Template_Project/RTOS1/trash/fit_2017-01-27 18_59_51/r_irq_rx/src/r_irq_rx.c
/***********************************************************************************************************************
* Description  : IRQ interrupt handler routines.
***********************************************************************************************************************/
#if IRQ_CFG_USE_IRQ0 == 1
#pragma interrupt (irq0_isr(vect = VECT(ICU, IRQ0)))
void irq0_isr(void)
{
    if((FIT_NO_FUNC != *(g_irq0_handle.p_irq_callback)) && (NULL != *(g_irq0_handle.p_irq_callback)))
    {
        (*(g_irq0_handle.p_irq_callback))((void*)&(g_irq0_handle));
    }
} /* end irq0_isr */
#endif

#if IRQ_CFG_USE_IRQ1 == 1
#pragma interrupt (irq1_isr(vect = VECT(ICU, IRQ1)))
void irq1_isr(void)
{
    if((FIT_NO_FUNC != *(g_irq1_handle.p_irq_callback)) && (NULL != *(g_irq1_handle.p_irq_callback)))
    {
        (*(g_irq1_handle.p_irq_callback))((void*)&(g_irq1_handle.irq_num));
    }
} /* end irq1_isr */
#endif

#if IRQ_CFG_USE_IRQ2 == 1
#pragma interrupt (irq2_isr(vect = VECT(ICU, IRQ2)))
void irq2_isr(void)
{
    if((FIT_NO_FUNC != *(g_irq2_handle.p_irq_callback)) && (NULL != *(g_irq2_handle.p_irq_callback)))
    {
        (*(g_irq2_handle.p_irq_callback))((void*)&(g_irq2_handle.irq_num));
    }
} /* end irq2_isr */
#endif

#if IRQ_CFG_USE_IRQ3 == 1
#pragma interrupt (irq3_isr(vect = VECT(ICU, IRQ3)))
void irq3_isr(void)
{
    if((FIT_NO_FUNC != *(g_irq3_handle.p_irq_callback)) && (NULL != *(g_irq3_handle.p_irq_callback)))
    {
        (*(g_irq3_handle.p_irq_callback))((void*)&(g_irq3_handle.irq_num));
    }
} /* end irq3_isr */
#endif

#if IRQ_CFG_USE_IRQ4 == 1
#pragma interrupt (irq4_isr(vect = VECT(ICU, IRQ4)))
void irq4_isr(void)
{
    if((FIT_NO_FUNC != *(g_irq4_handle.p_irq_callback)) && (NULL != *(g_irq4_handle.p_irq_callback)))
    {
        (*(g_irq4_handle.p_irq_callback))((void*)&(g_irq4_handle.irq_num));
    }
} /* end irq4_isr */
#endif

#if IRQ_CFG_USE_IRQ5 == 1
#pragma interrupt (irq5_isr(vect = VECT(ICU, IRQ5)))
void irq5_isr(void)
{
    if((FIT_NO_FUNC != *(g_irq5_handle.p_irq_callback)) && (NULL != *(g_irq5_handle.p_irq_callback)))
    {
        (*(g_irq5_handle.p_irq_callback))((void*)&(g_irq5_handle.irq_num));
    }
} /* end irq5_isr */
#endif

#if defined(VECT_ICU_IRQ7)
#if IRQ_CFG_USE_IRQ6 == 1
#pragma interrupt (irq6_isr(vect = VECT(ICU, IRQ6)))
void irq6_isr(void)
{
    if((FIT_NO_FUNC != *(g_irq6_handle.p_irq_callback)) && (NULL != *(g_irq6_handle.p_irq_callback)))
    {
        (*(g_irq6_handle.p_irq_callback))((void*)&(g_irq6_handle.irq_num));
    }
} /* end irq6_isr */
#endif

#if IRQ_CFG_USE_IRQ7 == 1
#pragma interrupt (irq7_isr(vect = VECT(ICU, IRQ7)))
void irq7_isr(void)
{
    if((FIT_NO_FUNC != *(g_irq7_handle.p_irq_callback)) && (NULL != *(g_irq7_handle.p_irq_callback)))
    {
        (*(g_irq7_handle.p_irq_callback))((void*)&(g_irq7_handle.irq_num));
    }
} /* end irq7_isr */
#endif
#endif

#if defined(VECT_ICU_IRQ15)
#if IRQ_CFG_USE_IRQ8 == 1
#pragma interrupt (irq8_isr(vect = VECT(ICU, IRQ8)))
void irq8_isr(void)
{
    if((FIT_NO_FUNC != *(g_irq8_handle.p_irq_callback)) && (NULL != *(g_irq8_handle.p_irq_callback)))
    {
        (*(g_irq8_handle.p_irq_callback))((void*)&(g_irq8_handle.irq_num));
    }
} /* end irq8_isr */
#endif

#if IRQ_CFG_USE_IRQ9 == 1
#pragma interrupt (irq9_isr(vect = VECT(ICU, IRQ9)))
void irq9_isr(void)
{
    if((FIT_NO_FUNC != *(g_irq9_handle.p_irq_callback)) && (NULL != *(g_irq9_handle.p_irq_callback)))
    {
        (*(g_irq9_handle.p_irq_callback))((void*)&(g_irq9_handle.irq_num));
    }
} /* end irq9_isr */
#endif

#if IRQ_CFG_USE_IRQ10 == 1
#pragma interrupt (irq10_isr(vect = VECT(ICU, IRQ10)))
void irq10_isr(void)
{
    if((FIT_NO_FUNC != *(g_irq10_handle.p_irq_callback)) && (NULL != *(g_irq10_handle.p_irq_callback)))
    {
        (*(g_irq10_handle.p_irq_callback))((void*)&(g_irq10_handle.irq_num));
    }
} /* end irq10_isr */
#endif

#if IRQ_CFG_USE_IRQ11 == 1
#pragma interrupt (irq11_isr(vect = VECT(ICU, IRQ11)))
void irq11_isr(void)
{
    if((FIT_NO_FUNC != *(g_irq11_handle.p_irq_callback)) && (NULL != *(g_irq11_handle.p_irq_callback)))
    {
        (*(g_irq11_handle.p_irq_callback))((void*)&(g_irq11_handle.irq_num));
    }
} /* end irq11_isr */
#endif

#if IRQ_CFG_USE_IRQ12 == 1
#pragma interrupt (irq12_isr(vect = VECT(ICU, IRQ12)))
void irq12_isr(void)
{
    if((FIT_NO_FUNC != *(g_irq12_handle.p_irq_callback)) && (NULL != *(g_irq12_handle.p_irq_callback)))
    {
        (*(g_irq12_handle.p_irq_callback))((void*)&(g_irq12_handle.irq_num));
    }
} /* end irq12_isr */
#endif

#if IRQ_CFG_USE_IRQ13 == 1
#pragma interrupt (irq13_isr(vect = VECT(ICU, IRQ13)))
void irq13_isr(void)
{
    if((FIT_NO_FUNC != *(g_irq13_handle.p_irq_callback)) && (NULL != *(g_irq13_handle.p_irq_callback)))
    {
        (*(g_irq13_handle.p_irq_callback))((void*)&(g_irq13_handle.irq_num));
    }
} /* end irq13_isr */
#endif

#if IRQ_CFG_USE_IRQ14 == 1
#pragma interrupt (irq14_isr(vect = VECT(ICU, IRQ14)))
void irq14_isr(void)
{
    if((FIT_NO_FUNC != *(g_irq14_handle.p_irq_callback)) && (NULL != *(g_irq14_handle.p_irq_callback)))
    {
        (*(g_irq14_handle.p_irq_callback))((void*)&(g_irq14_handle.irq_num));
    }
} /* end irq14_isr */
#endif

#if IRQ_CFG_USE_IRQ15 == 1
#pragma interrupt (irq15_isr(vect = VECT(ICU, IRQ15)))
void irq15_isr(void)
{
    if((FIT_NO_FUNC != *(g_irq15_handle.p_irq_callback)) && (NULL != *(g_irq15_handle.p_irq_callback)))
    {
        (*(g_irq15_handle.p_irq_callback))((void*)&(g_irq15_handle.irq_num));
    }
} /* end irq15_isr */
#endif
#endif

/***********************************************************************************************************************
end  r_irq_rx.c
***********************************************************************************************************************/
